import { DocsBody } from "fumadocs-ui/page";
import { Pre, CodeBlock } from 'fumadocs-ui/components/codeblock';
import { Metadata } from "next";
import { LinkButton } from "@/app/components/LinkButton";

export default async function Page({
  params,
}: {
  params: { slug?: string[] };
}) {
  return (
    <DocsBody style={{marginTop: "50px", marginBottom: "50px"}}>
      {/* <div className="fixed inset-0 z-[-1] overflow-hidden duration-1000 animate-in fade-in [perspective:2000px]">
        <div
          className="fixed bottom-[10%] left-1/2 size-[1200px] origin-bottom bg-primary/30 opacity-30"
          style={{
            transform: 'rotateX(75deg) translate(-50%, 400px)',
            backgroundImage:
              'radial-gradient(50% 50% at center,transparent,hsl(var(--background))), repeating-linear-gradient(to right,hsl(var(--primary)),hsl(var(--primary)) 1px,transparent 2px,transparent 100px), repeating-linear-gradient(to bottom,hsl(var(--primary)),hsl(var(--primary)) 2px,transparent 3px,transparent 100px)',
          }}
        />
      </div> */}
      <div className="container">
        <h1 className="text-center text-4xl font-bold">服務條款</h1>
        <div className="flex flex-row justify-center gap-2.5 max-sm:flex-col max-sm:items-stretch">
          <LinkButton
            href="/privacy"
            variant="primary"
          >
            隱私權政策
          </LinkButton>
          <LinkButton
            href="/copyright"
            variant="secondary"
          >
            版權政策
          </LinkButton>
        </div>
        <p>多元世界團隊（以下簡稱「乙方」）及其關係團隊茲提供遊戲（包含電腦軟體、行動應用程式或網頁遊戲等）、網站（包含乙方架構網頁或Facebook、Instagram等社群網站）、資訊、服務等（以下概括簡稱為「乙方遊戲服務」）供使用者（以下簡稱「甲方」）接觸或使用。</p>
        <p>甲方於註冊乙方遊戲服務帳號或使用乙方遊戲服務前應詳閱＜多元世界伺服器使用者服務條款＞（以下簡稱「服務條款」）、＜多元世界團隊個人資料暨隱私政策條款＞（以下簡稱「隱私權政策」）及，以保障甲方權益。本服務條款構成甲乙雙方間契約，甲方於閱畢本服務條款內容並於確認頁面按下「同意」選項或註冊乙方遊戲服務帳號或使用乙方遊戲服務，即視為甲方完全了解並同意本服務條款。</p>
        <p>倘若甲方為限制行為能力人者，本契約訂定時，應經甲方之法定代理人同意，本契約始生效力；甲方為無行為能力人者，本契約之訂定，應由甲方之法定代理人代為之。</p>
        <p>若甲方（或其法定代理人）不同意本服務條款，甲方不得安裝、複製或使用任何乙方遊戲服務。</p>

        <h2> 一、 名詞定義 </h2>
        <p>遊戲：指由乙方或其關係團隊提供之遊戲以及與該遊戲相關之服務。</p>
        <p>付費遊戲點數：指甲方依照乙方所訂付費方式，預付一定金額購買之虛擬貨幣，該虛擬貨幣得於遊戲中作為支付工具使用（例如兌換遊戲中虛擬道具、換取抽選虛擬道具或遊戲角色機會、開啟遊戲中特定功能或用以解鎖或擴充遊戲關卡等）。</p>
        <p>非付費遊戲點數：指甲方非透過支付價金方式獲得之虛擬貨幣或道具（例如乙方因舉辦活動所發送或乙方因任何情況提供給甲方作為補償之用者），該虛擬貨幣得於遊戲中作為支付工具使用（例如兌換遊戲中虛擬道具、換取抽選虛擬道具或遊戲角色機會、開啟遊戲中特定功能或用以解鎖或擴充遊戲關卡等）。</p>
        <p>遊戲點數：指付費遊戲點數及非付費遊戲點數。</p>
        <p>虛擬道具：指可於遊戲中使用之虛擬物品，甲方僅能在合乎法律和遊戲管理規則的情況下擁有對虛擬道具的使用權。</p>
        <p>遊戲管理規則：係指由乙方訂立且乙方有權修改，用以規範遊戲進行方式之規則。</p>
        <p>遊戲歷程：指自甲方開始使用乙方遊戲服務起至結束使用乙方遊戲服務止，電腦系統對甲方遊戲進行過程所為之記錄。</p>
        <p>暫停遊戲權限（凍結）：係指以限制登入遊戲或暫時限制甲方遊戲帳號使用權利等方式，暫時禁止甲方或限縮甲方使用乙方遊戲服務。</p>
        <p>外掛程式：指非由乙方提供，以干預、影響、改變或不當紀錄乙方線上遊戲運作之程式。</p>
        <p>關係團隊：指獨立存在而相互間具有 (1)控制從屬關係或 (2)相互投資關係之團隊。</p>
        <p>必要成本：指乙方為履行契約而已支出之成本或已給付予第三人之費用，包含但不限於第三方平台費用或匯款手續費等。</p>

        <h2> 二、 服務條款之內容 </h2>
        <p>以下項目視為本服務條款之一部分，與本服務條款具有相同之效力：</p>
        <ol>
          <li>乙方有關遊戲之公告、活動規定或廣告宣傳內容。</li>
          <li>計費制遊戲之費率表及各遊戲管理規則。</li>
        </ol>
        <p>本服務條款如有疑義時，應為有利於消費者之解釋。</p>

        <h2> 三、 遊戲服務應載明之資訊 </h2>
        <p>乙方應於官網首頁、遊戲登入頁面或購買頁面及遊戲套件包裝上載明以下事項：</p>
        <ol>
          <li>依遊戲軟體分級管理辦法規定標示遊戲分級級別及禁止或適合使用之年齡層。</li>
          <li>進行遊戲服務之最低軟硬體需求。</li>
          <li>有提供付費購買之機會中獎商品或活動，其活動內容、獎項及中獎等資訊，應記載「此為機會中獎商品，消費者購買或參與活動不代表即可獲得特定商品」等提示。</li>
        </ol>
        <p>乙方應於官網首頁、遊戲登入頁面或購買頁面以中文明顯標示，若甲方為限制行為能力人或無行為能力人，除應符合本服務條款前言之規定，並應於甲方之法定代理人閱讀、瞭解並同意本服務條款之所有內容後，方得使用乙方遊戲服務，本服務條款變更時亦同。</p>

        <h2> 四、 契約解除權規定 </h2>
        <p>甲方得於開始遊戲後七日內，以書面告知乙方解除契約，甲方未將虛擬寶物、付費遊戲點數使用之前提下，甲方無需說明理由及負擔任何費用。</p>
        <p>付費遊戲點數、虛擬寶物等一經甲方於遊戲中使用（包含但不限於購買遊戲中虛擬道具、換取抽選虛擬道具或角色之機會或用以解鎖或擴充關卡等）即因其性質無法返還，不適用消費者保護法通訊交易鑑賞期相關規定，亦不得申請退費。</p>

        <h2> 五、 通訊交易契約解除權特別規定 </h2>
        <p>若甲方自開始遊戲後，已將虛擬寶物、遊戲點數進行使用，包含但不限於甲方虛寶轉移所有權、販賣，經由乙方系統機制進行屬性改變等，及對遊戲點數進行兌換、轉移，經由乙方系統機制進行屬性改變等，甲方不得申請退費。</p>
        <p>甲方所持有之非付費遊戲點數及虛擬道具並無金錢價值，於任何情況下均不得申請退費。</p>
        <p>若為甲方直接付費解鎖遊戲特定關卡、擴充遊戲內容或兌換特定道具之情形，因屬一經乙方提供即為完成之線上服務，不適用消費者保護法通訊交易鑑賞期相關規定，亦不得申請退費。</p>
        <p>倘甲方係透過第三方平台（包含但不限於iOS系統或Android系統）購買付費遊戲點數，甲方申請退費時應依據該第三方平台之程序及相關規定。</p>
        <p>若有限制行為能力人未經同意或無行為能力人未由法定代理人代為購買付費遊戲點數致生法定代理人主張退費時，法定代理人得依官網公告流程，備妥證明文件並提出申請，經乙方確認後，退還甲方未使用之遊戲費用。如該次購買係透過第三方平台（包含但不限於iOS系統或Android系統），法定代理人申請退費時應依據該第三方平台之程序及相關規定辦理。</p>

        <h2> 六、 計費標準、變更及其通知相關規定 </h2>
        <p>乙方遊戲服務之收費計算方式為：其他收費制。</p>
        <p>乙方遊戲服務內（例如：遊戲商城、線上商店、贈品中心等）有提供需甲方額外付費購買之付費遊戲點數、商品或其他服務之機制（例如：虛擬貨幣或寶物、進階道具等），甲方應在官網首頁、遊戲登入頁面或購買頁面公告載明付款方式及商品資訊。</p>
        <p>使用遊戲主服務之收費若有費率調整時，乙方應於預定調整生效日三十日前於官網首頁、遊戲登入頁面或購買頁面公告；若甲方於註冊帳號時已登錄通訊資料者，並依甲方登錄之通訊資料通知甲方。</p>
        <p>前項費率如有調整時，應自調整生效日起按新費率計收；若新費率高於舊費率時，甲方在新費率生效日前已於官網中登錄之付費購買點數或遊戲費用應依舊費率計收。</p>

        <h2> 七、 智慧財產權 </h2>
        <p>乙方遊戲服務、遊戲及所有與乙方服務或遊戲相關之著作、紀錄或資料，其著作權、專利權、商標權、營業秘密、其他智慧財產權或申請智慧財產權之權利，所有權或其他權利（包含但不限於遊戲、影片、程式碼、物件、人物、名稱、故事、對話、概念、圖形、動畫、聲音、遊戲歷程等），均為乙方或其個別權利人所有。非經乙方或其個別權利人事先合法授權，甲方不得基於任何目的重製、傳輸、改作、編輯、以其他任何形式使用或為任何侵權行為，違者應負一切法律責任。但甲方參考遊戲中素材所為之文字或視覺美術二次創作，在滿足以下所有條件的情況下，甲方可以自由進行：</p>
        <ol>
          <li>甲方的創作不得直接或間接使用屬於乙方之或第三方之著作物全部或一部，且甲方創作必須具有創作性質； </li>
          <li>該創作僅用於甲方個人的非商業使用或甲方個人直接進行的小規模販售（即不透過第三方仲介、委託販賣、出版發行等情況）；</li>
          <li>甲方必須充分揭露該項創作是乙方網站或遊戲的二次創作，不得有使他人混淆誤認為乙方官方作品之虞；</li>
          <li>該項創作或販售行為不至於損害乙方或其他權利人的商譽或任何權利。</li>
        </ol>

        <h2> 八、帳號密碼之使用 </h2>
        <p>甲方完成註冊程序後取得之帳號及密碼，僅供甲方本人使用。該組帳號一經設定即不得變更。</p>
        <p>前項之密碼得依乙方提供之修改機制進行變更。乙方人員（含客服人員、遊戲管理員）不得主動詢問甲方之密碼。乙方應於契約終止後三十日內，保留甲方之帳號及附隨於該帳號之電磁紀錄。</p>
        <p>本服務條款非因可歸責甲方之事由而終止者，甲方於前述期間內辦理續用後，有權繼續使用帳號及附隨於該帳號之電磁紀錄。</p>
        <p>第2項期限屆滿時，甲方仍未辦理續用，乙方得刪除該帳號及附隨於該帳號之所有資料，但法令另有規定者不在此限。</p>
        <p>甲方應負帳號及密碼保管之責，不得將該組帳號及密碼轉讓、交付、揭露、出售或出借予第三人，亦不得使第三人使用該帳號。如因而產生糾紛，屬可歸責於甲方之情形，由甲方自行負責。</p>
        <p>如甲方未註冊帳號密碼而是以訪客身份使用乙方遊戲服務，乙方可能無法依照本服務條款與甲方進行聯繫或查詢甲方遊戲歷程。</p>

        <h2> 九、帳號密碼遭非法使用之通知與處理 </h2>
        <p>當事人一方如發現帳號、密碼被非法使用時，應立即通知對方並由乙方進行查證，經乙方確認有前述情事後，得暫停該組帳號或密碼之使用權，更換帳號或密碼予甲方，立即限制第三人就本遊戲服務之使用權利，並將相關處理方式揭載於遊戲管理規則。</p>
        <p>乙方應於暫時限制遊戲使用權利之時起，即刻以官網公告、簡訊、電子郵件、推播或其他雙方約定之方式通知前項第三人提出說明。如該第三人未於接獲通知時起七日內提出說明，乙方應直接回復遭不當移轉之電磁紀錄予甲方，不能回復時可採其他雙方同意之相當補償方式，並於回復後解除對第三人之限制。但乙方有提供免費安全裝置（例如：防盜卡、電話鎖等）而甲方不使用或有其他可歸責於甲方之事由，乙方不負回復或補償責任。</p>
        <p>第一項之第三人不同意乙方前項之處理時，甲方得依報案程序，循司法途徑處理。</p>
        <p>乙方依第一項規定限制甲方或第三人之使用權時，在限制使用期間內，乙方不得向甲方或第三人收取費用。</p>
        <p>甲方如有申告不實之情形致生乙方或第三人權利受損時，甲方應負一切法律責任。</p>

        <h2> 十、 遊戲歷程之保存與查詢 </h2>
        <p>乙方應保存甲方之個人遊戲歷程紀錄，保存期間為三十日，以供甲方查詢。甲方得以書面或網路（包含電子郵件或網路社群私訊）申請調閱甲方之個人遊戲歷程，且須提出與身份證明文件相符之個人資料並回答乙方用以查核身分之相關問題以供查驗。</p>
        <p>乙方接獲甲方之查詢申請，應提供第一項所列之甲方個人遊戲歷程，並於七日內以書面或電子郵件方式提供資料。但甲方透過第三方平台（包含但不限於iOS系統或Android系統）支付費用之交易紀錄持有者係第三方平台，乙方可能無法提供該交易紀錄供甲方查詢。</p>

        <h2> 十一、 電磁紀錄 </h2>
        <p>乙方遊戲服務之所有電磁紀錄均屬乙方所有，乙方並應維持甲方相關電磁記錄之完整；甲方了解本遊戲之所有電磁紀錄，僅為娛樂過程中提供之遊戲樂趣與體驗，並不具有金錢交易價值。</p>
        <p>甲方對於前項電磁紀錄有使用支配之權利，但不包括乙方遊戲服務範圍外之移轉、收益行為。</p>

        <h2> 十二、 個人資料保護與隱私權政策 </h2>
        <p>關於甲方個人資料之保護，依個人資料保護法及相關法律規定處理。相關規定請參 <code>私政策條款</code>。</p>
        <p>如甲方未提供正確之個人資料或原提供之資料已不符合真實而未更新，乙方得於甲方提供真實資料或更新資料前，暫停遊戲服務（包含但不限於暫停遊戲權限及遊戲歷程查詢之服務）；如甲方未提供正確之個人資料或原提供之資料已不符合真實而未更新，乙方無須對甲方因本服務條款所發生的任何損害負責。</p>
        <p>甲方於遊戲進行中如有任何違反法令或侵害他人權利之虞者，為配合主管機關或司法機關調查，乙方得將甲方個人資料、註冊資訊、遊戲歷程等提供該當主管機關。</p>

        <h2> 十三、 公開與授權 </h2>
        <p>乙方服務可能提供甲方表述之平台（包含遊戲中對話、評論功能、上傳圖像等）。乙方無法保證甲方於公開場合之表述不被第三人使用，如因第三人未經授權使用甲方表述致甲方受有損害或產生任何爭議，甲方應自行負責。</p>
        <p>甲方對其透過乙方服務所為之公開表述應自行承擔一切法律責任，乙方無事先審查之義務，但乙方有權修改或刪除不當表述，包含侵害他人著作權、歧視性、侮辱性、爭議性、猥褻性、不雅性、違反本服務條款或違反法律之發言等。</p>
        <p>乙方有權監控或記錄甲方透過使用乙方遊戲服務進行溝通之内容，甲方應同意並知悉甲方透過使用乙方遊戲服務進行之溝通並不屬於甲方之個人隱私。乙方有權以任何理由揭露甲方的溝通内容，包括但不限於：</p>
        <ol>
          <li>依據相關法律規定； </li>
          <li>行政機關或司法機關要求揭露；</li>
          <li>為執行本協議的條款或其他任何遊戲規範；</li>
          <li>為保障乙方的合法權益和救濟途徑。</li>
        </ol>
        <p>甲方同意無償、永久、不可撤回地授權乙方或其指定第三人於全球以任意方式利用其透過乙方遊戲服務所為之公開表述（包含複製、改寫、出版、發行、公開發表等所有著作權法上得授權之權利）。</p>

        <h2> 十四、連線品質 </h2>
        <p>甲方使用乙方服務必須自行配備上網所需之各項設備，以及負擔「網際網絡連線費用」等電訊相關費用。</p>
        <p>有關甲方使用電信事業之電信機線設備，如因電信機線設備之障礙或阻斷，致發生錯誤、遲滯、中斷或不能傳遞等非乙方所能控制之情況致造成損害時，乙方將不負賠償責任。</p>
        <p>乙方為維護乙方遊戲服務相關系統及軟硬體設備而預先規劃暫停本遊戲服務之全部或一部時，應於一日前於官網首頁、遊戲登入頁面或購買頁面公告。 但因臨時性、急迫性或不可歸責於乙方之事由者，不在此限。</p>
        <p>因可歸責乙方事由，致甲方不能連線使用乙方遊戲服務時，乙方應立即更正或修復。對於甲方於無法使用期間遭扣除遊戲費用或遊戲內商品，乙方應返還遊戲費用或商品，無法返還時則應提供其他合理之補償。</p>

        <h2> 十五、團隊經營者及消費者責任 </h2>
        <p>乙方應依本服務條款之規定負有於提供乙方服務時，維護其自身電腦系統，符合當時科技或專業水準可合理期待之安全性。</p>
        <p>電腦系統或電磁紀錄受到破壞，或電腦系統運作異常時，乙方應於採取合理之措施後儘速予以回復。</p>
        <p>乙方違反前二項規定或因遊戲程式漏洞致生甲方損害時，應依甲方遊戲中受損害情形，負損害賠償責任，但乙方能證明其無過失者，得減輕其賠償責任。</p>
        <p>乙方電腦系統發生第二項所稱情況時，於完成修復並正常運作之前，乙方不得向甲方收取費用。</p>
        <p>甲方因共用帳號、委託他人付費購買遊戲點數衍生與第三人間之糾紛，乙方得不予協助處理。</p>

        <h2> 十六、遊戲管理規則 </h2>
        <p>為規範遊戲進行之方式，乙方應訂立合理公平之遊戲管理規則，甲方應遵守乙方公告之遊戲管理規則。</p>
        <p>遊戲管理規則之變更應依本服務條款第十九條之程序為之。</p>
        <p>遊戲管理規則有下列情形之一者，其規定無效：</p>
        <ol>
          <li>牴觸本服務條款之規定。</li>
          <li>剝奪或限制甲方之契約上權利。但乙方依本服務條款第十七條或第二十條之規定處理者，不在此限。</li>
        </ol>

        <h2> 十七、 違反遊戲管理規則之處理 </h2>
        <p>除本服務條款另有規定外，有事實足證甲方於遊戲服務中違反遊戲管理規則時，乙方應於官網首頁、遊戲登入頁面或購買頁面公告，並依甲方登錄之通訊資料通知甲方。</p>
        <p>甲方違反遊戲管理規則，若情節輕微，乙方可通知甲方於一定期間內改善。經乙方通知改善而未改善者，乙方得依遊戲管理規則，按其情節輕重限制甲方之遊戲使用權利或暫停遊戲權限。如甲方因同一事由再次違反遊戲管理規則時，乙方得立即依遊戲管理規則限制甲方進行遊戲之權利。</p>
        <p>若情節嚴重，包含但不限於造成乙方之電磁紀錄毀損、影響他人遊戲服務品質、違反乙方當地法規時，乙方得依遊戲管理規則，按其情節輕重限制甲方之遊戲使用權利或暫停遊戲權限。</p>
        <p>乙方依遊戲管理規則停止甲方進行遊戲之各項權利，每次不得超過七日。但甲方有重大違約情況（包含但不限於本服務條款第二十條第四項之情形、本服務條款十七條之情節嚴重之情形）致乙方解除或終止與甲方契約關係者不在此限。</p>

        <h2> 十八、申訴權利 </h2>
        <p>甲方不滿意乙方提供之連線品質、遊戲管理、費用計費、其他相關之服務品質，或對乙方依遊戲管理規則之處置不服時，得於收到通知之翌日起七日內以電子郵件或書面提出申訴，乙方接獲申訴後，應於十五日內回覆處理之結果。</p>
        <p>乙方應於官網或遊戲管理規則中明訂服務電子郵件等相關聯絡資訊與申訴管道。</p>
        <p>甲方反映第三人利用外掛程式或其他影響遊戲公平性之申訴，依第一項規定辦理。</p>

        <h2> 十九、服務條款之變更 </h2>
        <p>乙方修改本服務條款時，應於官網首頁、遊戲登入頁面或購買頁面公告之，並依甲方登錄之通訊資料通知甲方。</p>
        <p>乙方未依前項進行公告及通知者，本服務條款之變更無效。</p>
        <p>甲方於第一項通知到達後十五日內：</p>
        <ol>
          <li>甲方未為反對之表示者，乙方依服務條款變更後之內容繼續提供本遊戲服務。</li>
          <li>甲方為反對之表示者，依甲方終止契約方式處理。</li>
          <li>若甲方為限制行為能力人或無行為能力人，關於本服務條款之變更，應由甲方之法定代理人閱讀、瞭解並同意後，甲方方得繼續使用本遊戲服務。</li>
        </ol>

        <h2> 二十、服務條款之終止及退費 </h2>
        <p>甲方得隨時以書面或電子郵件通知終止與乙方之契約關係。</p>
        <p>若甲方逾一年期間未登入使用乙方遊戲服務，乙方得通知甲方於十五日內登入，如甲方屆期仍未登入使用，則乙方得終止本服務條款。</p>
        <p>契約終止時，乙方於扣除必要成本後，應於三十日內以現金或匯款方式退還甲方已購買而未使用之付費遊戲點數之費用，若以現金退款，甲方應自行至乙方營業所領取退款。倘甲方係透過第三方平台（如Android或iOS系統）購買付費遊戲點數，甲方應先向第三方平台申請退費，申請退費時除應符合本服務條款外，亦應遵守第三方平台之規定辦理。</p>
        <p>甲方有下列重大情事之一者，乙方依甲方登錄之通訊資料通知甲方後，得立即終止服務條款：</p>
        <ol>
          <li>利用任何系統或工具對乙方電腦系統之惡意攻擊或破壞。</li>
          <li>以利用外掛程式、病毒程式、遊戲程式漏洞或其他違反遊戲常態設定或公平合理之方式進行遊戲。包括但不限於：使用作弊程式、利用自動化執行軟體（bots）自動控制遊戲、服務器或任何組件或其功能、使用駭客程式或任何其他未經授權之第三方軟體。</li>
          <li>以冒名、詐騙或其他虛偽不正等方式付費購買點數或遊戲內商品。</li>
          <li>因同一事由違反遊戲管理規則達三次數以上，經依第十七條第二項通知改善而未改善者。</li>
          <li>經司法機關查獲從事任何不法之行為。</li>
          <li>實施反向工程、反編譯、拆解、破譯或行為者。</li>
          <li>利用乙方服務或遊戲之一部或全部作為任何未經乙方授權的商業用途，包括但不限於透過乙方服務或遊戲從事任何商業廣告或行銷活動。</li>
          <li>使用任何第三方軟體或以其他不法方式取得來自或儲存於乙方客戶端或遊戲之資訊。</li>
          <li>提供任何遊戲配對服務，對乙方通訊協定進行攔截、模擬或重新導向，包括但不限於在網際網路、網路連線機器或於內容匯聚網路進行遊戲。</li>
          <li>未經乙方授權或同意協助、建立或維護任何連接至遊戲的連線，包括但不限於連接至未經授權伺服器的任何模擬或試圖模擬之連線，或其他任何遊戲；以及使用未經授權程式或工具的任何連線。</li>
          <li>未經乙方授權而出售、出租、設定擔保權益或轉讓甲方就本遊戲所持有之權利予他人。</li>
          <li>中斷或協助中斷任何用以支援遊戲或任何遊戲環境之電腦或者任何其他玩家的遊戲過程。</li>
          <li>發布任何辱罵、威脅、誹謗、侮辱、歧視性、猥褻性、攻擊性言論、利用遊戲從事不法行為、或意圖騷擾、傷害任何人，情節重大者。</li>
          <li>公開或私下傳播任何存在並可利用的遊戲漏洞者。</li>
        </ol>
        <p>乙方對前項事實認定產生錯誤或無法舉證時，乙方應恢復對甲方之服務契約關係。</p>

        <h2> 二十一、 停止營運 </h2>
        <p>因乙方停止遊戲服務之營運而終止服務條款者，應於終止前三十日公告於官網首頁、遊戲登入頁面或購買頁面；若甲方於註冊帳號時已登錄通訊資料者，並依甲方登錄之通訊資料通知甲方。</p>
        <p>乙方未依前項期間公告並通知者， 除應退還甲方未使用之付費遊戲點數且不得扣除必要成本外，並應提供甲方其他合理之補償。</p>

        <h2> 二十二、 送達 </h2>
        <p>有關本服務條款所有事項之通知，甲方同意乙方以甲方登錄之聯絡地址或電子郵件地址為送達。</p>
        <p>前項登錄地址或電子郵件地址若有變更，甲方應即通知乙方。乙方應依變更後之地址或電子郵件地址為送達。</p>
        <p>乙方依本條地址所為之通知發出後，以書面通知到達甲方，或電子郵件進入甲方之電子郵件伺服器中，推定為已送達。</p>
        <p>因甲方之故意或過失致乙方無法送達者，乙方對甲方因無法送達所致之損害不負賠償責任。</p>

        <h2> 二十三、 語言 </h2>
        <p>本服務條款中文以外版本均僅供甲方參考之用，如其他語言的版本與中文版有不一致的地方，一切皆以中文版本為準。</p>

        <h2> 二十四、準據法及管轄法院 </h2>
        <p>本服務條款、遊戲管理規則及相關事項之解釋與適用，以及甲方因使用乙方遊戲服務而與乙方間所生之權利義務關係，應以中華民國法律為準據法。</p>
        <p>因本服務條款而生之事件，雙方合意以臺灣臺北地方法院為第一審管轄法院。</p>
        <p>前項約定不排除消費者保護法第四十七條或民事訴訟法第二十八條第二項、第四百三十六條之九規定之適用。</p>
      </div>
    </DocsBody>
  );
}

export function generateMetadata({
  params,
}: {
  params: { slug: string };
}): Metadata {
  return {
    title: "服務條款 - 多元世界",
    description: "服務條款",
  };
}